Examinator/src/InformationRegisters/ИспользованиеДополнительныхМатериаловСУЗ/ИспользованиеДополнительныхМатериаловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеДополнительныхМатериаловСУЗ</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ИспользованиеДополнительныхМатериаловСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ЗАПИСЬ

Функция МожноИспользоватьДополнительныеМатериалы(ЭлектронныйРесурс, Задание=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МожноИспользоватьДополнительныеМатериалы = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеМатериалыСУЗ");
	
	Если МожноИспользоватьДополнительныеМатериалы Тогда
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		Если МожноИспользоватьДополнительныеМатериалы
			И ЗначениеЗаполнено(Задание)
			И ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
			
			МожноИспользоватьДополнительныеМатериалы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задание, "ИспользоватьДополнительныеМатериалы");
			
		КонецЕсли;
		//----------------------------------//
		
		Если МожноИспользоватьДополнительныеМатериалы Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИспользованиеДополнительныхМатериаловСУЗ.Использование
				|ИЗ
				|	РегистрСведений.ИспользованиеДополнительныхМатериаловСУЗ КАК ИспользованиеДополнительныхМатериаловСУЗ
				|ГДЕ
				|	ИспользованиеДополнительныхМатериаловСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс";

			Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

			Результат = Запрос.Выполнить();

			Если Результат.Пустой() Тогда
				
				МожноИспользоватьДополнительныеМатериалы = Ложь;
				
			Иначе
			
				ВыборкаДетальныеЗаписи = Результат.Выбрать();

				ВыборкаДетальныеЗаписи.Следующий();
				
				Если НЕ ВыборкаДетальныеЗаписи.Использование Тогда					
					МожноИспользоватьДополнительныеМатериалы = Ложь;					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МожноИспользоватьДополнительныеМатериалы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
